In [3]:
import pandas as pd
import matplotlib.pyplot as mp
import numpy as np
import sqlite3 as db

In [15]:
path= 'C:\\Users\\ProBook\\Downloads\\flight.db'
data= db.connect(path)

In [16]:
c =data.cursor()

In [17]:
#read data into pandas dataframe
q1='''select * from airlines'''
view = pd.read_sql_query(q1,data)
view.head()

,index,id,name,alias,iata,icao,callsign,country,active
0,0,1,Private flight,\N,-,None,None,None,Y
1,1,2,135 Airways,\N,None,GNL,GENERAL,United States,N
2,2,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
3,3,4,2 Sqn No 1 Elementary Flying Training School,\N,None,WYT,None,United Kingdom,N
4,4,5,213 Flight Unit,\N,None,TFU,None,Russia,N

In [35]:
#group by
q2='''select name,callsign,active from airlines GROUP BY country LIMIT 50'''
r2 = pd.read_sql_query(q2,data)
r2.head()

                      name                           callsign active
0  Transports et Travaux A                               None      N
1                  Sedalia                           Marshall      N
2                    Aires   Aerovias de Integracion Regional      Y
3  Southern Jersey Airways                               Inc.      N
4      Active Aero Charter                               Inc.      N

In [30]:
#IN
q3='''select name,callsign,active,country from airlines where country IN ('United State','Russia')'''
r3 = pd.read_sql_query(q3,data)
r3.head()

                            name        callsign active country
0                213 Flight Unit            None      N  Russia
1  223 Flight Unit State Airline  CHKALOVSK-AVIA      N  Russia
2              224th Flight Unit      CARGO UNIT      N  Russia
3                    Abakan-Avia     ABAKAN-AVIA      N  Russia
4             Aerotrans Airlines            None      N  Russia

In [31]:
#Distinct
q4 = '''select Distinct city from airports'''
r4 = pd.read_sql_query(q4,data)
r4.head()

           city
0        Goroka
1        Madang
2   Mount Hagen
3        Nadzab
4  Port Moresby

In [34]:
#count
q5 = '''select COUNT(city)  from airports'''
r5 = pd.read_sql_query(q5,data)
print(r5)

   COUNT(city)
0         8107

In [39]:
#insert rows
c.execute("INSERT into airlines values(6048, 19846, 'Successful flight', '', '', null, null, null, 'Y')")

In [42]:
#to save the values
data.commit()

In [49]:
#view the last inserted row
q6='''select * from airlines where id=19846'''
r6 = pd.read_sql_query(q6,data)
print(r6)

   index     id               name alias iata  icao callsign country active
0   6048  19846  Successful flight             None     None    None      Y